# -*- coding: utf-8 -*-

# WEEKDAYS = ["星期一", "星期二","星期三","星期四","星期五","星期六","星期天"]
WEEKDAYS = ["星期天", "星期一", "星期二", "星期三", "星期四", "星期五", "星期六"]

STUDENTS = [
        "陈行知", "陈瑾瑜", "陈婧瑶", "陈立行", "冯诗悦", "符蓝之",
        "郝昱晨", "黄睿隽", "李昊睿", "李婧语",  "李佳凝", "林可心",
        "林一希",  "李圣博", "刘钥宁", "刘翼嘉", "刘语麟",  "刘子轩",
        "乐骁悦",  "孟恩泽", "欧阳筱颖", "祁翌", "阮俊权", "宋沛霖",
        "田紫伊", "童励", "肖峻文", "许奕曦", "姚禹汐", "曾智",
        "张小晗", "张臻颖", "赵浩宇", "郑博予", "郑泽瑜", "周奕彤"
]

WILLING_JSON = "willing.json"
MSG_DATE = "期望值日的日期："
MSG_WEEKDAY = "期望值日的工作日："
SCREEN_FILE = "duty_table.jpg"
WORD_FILE = "duty_table.docx"
TEXT_FILE = "duty_table.txt"
